MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsaml21/thirdparty/atsaml21/component/pac.h
/* -------- PAC_STATUSD : (PAC Offset: 0x40) ( R/ 32) Peripheral write protection status - Bridge D -------- */
#define PAC_STATUSD_RESETVALUE                _U_(0x00)                                            /**<  (PAC_STATUSD) Peripheral write protection status - Bridge D  Reset Value */

#define PAC_STATUSD_EVSYS_Pos                 _U_(0)                                               /**< (PAC_STATUSD) EVSYS APB Protect Enable Position */
#define PAC_STATUSD_EVSYS_Msk                 (_U_(0x1) << PAC_STATUSD_EVSYS_Pos)                  /**< (PAC_STATUSD) EVSYS APB Protect Enable Mask */
#define PAC_STATUSD_EVSYS(value)              (PAC_STATUSD_EVSYS_Msk & ((value) << PAC_STATUSD_EVSYS_Pos))
#define PAC_STATUSD_SERCOM5_Pos               _U_(1)                                               /**< (PAC_STATUSD) SERCOM5 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM5_Msk               (_U_(0x1) << PAC_STATUSD_SERCOM5_Pos)                /**< (PAC_STATUSD) SERCOM5 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM5(value)            (PAC_STATUSD_SERCOM5_Msk & ((value) << PAC_STATUSD_SERCOM5_Pos))
#define PAC_STATUSD_TC4_Pos                   _U_(2)                                               /**< (PAC_STATUSD) TC4 APB Protect Enable Position */
#define PAC_STATUSD_TC4_Msk                   (_U_(0x1) << PAC_STATUSD_TC4_Pos)                    /**< (PAC_STATUSD) TC4 APB Protect Enable Mask */
#define PAC_STATUSD_TC4(value)                (PAC_STATUSD_TC4_Msk & ((value) << PAC_STATUSD_TC4_Pos))
#define PAC_STATUSD_ADC_Pos                   _U_(3)                                               /**< (PAC_STATUSD) ADC APB Protect Enable Position */
#define PAC_STATUSD_ADC_Msk                   (_U_(0x1) << PAC_STATUSD_ADC_Pos)                    /**< (PAC_STATUSD) ADC APB Protect Enable Mask */
#define PAC_STATUSD_ADC(value)                (PAC_STATUSD_ADC_Msk & ((value) << PAC_STATUSD_ADC_Pos))
#define PAC_STATUSD_AC_Pos                    _U_(4)                                               /**< (PAC_STATUSD) AC APB Protect Enable Position */
#define PAC_STATUSD_AC_Msk                    (_U_(0x1) << PAC_STATUSD_AC_Pos)                     /**< (PAC_STATUSD) AC APB Protect Enable Mask */
#define PAC_STATUSD_AC(value)                 (PAC_STATUSD_AC_Msk & ((value) << PAC_STATUSD_AC_Pos))
#define PAC_STATUSD_PTC_Pos                   _U_(5)                                               /**< (PAC_STATUSD) PTC APB Protect Enable Position */
#define PAC_STATUSD_PTC_Msk                   (_U_(0x1) << PAC_STATUSD_PTC_Pos)                    /**< (PAC_STATUSD) PTC APB Protect Enable Mask */
#define PAC_STATUSD_PTC(value)                (PAC_STATUSD_PTC_Msk & ((value) << PAC_STATUSD_PTC_Pos))
#define PAC_STATUSD_OPAMP_Pos                 _U_(6)                                               /**< (PAC_STATUSD) OPAMP APB Protect Enable Position */
#define PAC_STATUSD_OPAMP_Msk                 (_U_(0x1) << PAC_STATUSD_OPAMP_Pos)                  /**< (PAC_STATUSD) OPAMP APB Protect Enable Mask */
#define PAC_STATUSD_OPAMP(value)              (PAC_STATUSD_OPAMP_Msk & ((value) << PAC_STATUSD_OPAMP_Pos))
#define PAC_STATUSD_CCL_Pos                   _U_(7)                                               /**< (PAC_STATUSD) CCL APB Protect Enable Position */
#define PAC_STATUSD_CCL_Msk                   (_U_(0x1) << PAC_STATUSD_CCL_Pos)                    /**< (PAC_STATUSD) CCL APB Protect Enable Mask */
#define PAC_STATUSD_CCL(value)                (PAC_STATUSD_CCL_Msk & ((value) << PAC_STATUSD_CCL_Pos))
#define PAC_STATUSD_Msk                       _U_(0x000000FF)                                      /**< (PAC_STATUSD) Register Mask  */

#define PAC_STATUSD_SERCOM_Pos                _U_(1)                                               /**< (PAC_STATUSD Position) SERCOM5 APB Protect Enable */
#define PAC_STATUSD_SERCOM_Msk                (_U_(0x1) << PAC_STATUSD_SERCOM_Pos)                 /**< (PAC_STATUSD Mask) SERCOM */
#define PAC_STATUSD_SERCOM(value)             (PAC_STATUSD_SERCOM_Msk & ((value) << PAC_STATUSD_SERCOM_Pos)) 
#define PAC_STATUSD_TC_Pos                    _U_(2)                                               /**< (PAC_STATUSD Position) TC4 APB Protect Enable */
#define PAC_STATUSD_TC_Msk                    (_U_(0x1) << PAC_STATUSD_TC_Pos)                     /**< (PAC_STATUSD Mask) TC */
#define PAC_STATUSD_TC(value)                 (PAC_STATUSD_TC_Msk & ((value) << PAC_STATUSD_TC_Pos)) 

/* -------- PAC_STATUSE : (PAC Offset: 0x44) ( R/ 32) Peripheral write protection status - Bridge E -------- */
#define PAC_STATUSE_RESETVALUE                _U_(0x00)                                            /**<  (PAC_STATUSE) Peripheral write protection status - Bridge E  Reset Value */

#define PAC_STATUSE_PAC_Pos                   _U_(0)                                               /**< (PAC_STATUSE) PAC APB Protect Enable Position */
#define PAC_STATUSE_PAC_Msk                   (_U_(0x1) << PAC_STATUSE_PAC_Pos)                    /**< (PAC_STATUSE) PAC APB Protect Enable Mask */
#define PAC_STATUSE_PAC(value)                (PAC_STATUSE_PAC_Msk & ((value) << PAC_STATUSE_PAC_Pos))
#define PAC_STATUSE_DMAC_Pos                  _U_(1)                                               /**< (PAC_STATUSE) DMAC APB Protect Enable Position */
#define PAC_STATUSE_DMAC_Msk                  (_U_(0x1) << PAC_STATUSE_DMAC_Pos)                   /**< (PAC_STATUSE) DMAC APB Protect Enable Mask */
#define PAC_STATUSE_DMAC(value)               (PAC_STATUSE_DMAC_Msk & ((value) << PAC_STATUSE_DMAC_Pos))
#define PAC_STATUSE_Msk                       _U_(0x00000003)                                      /**< (PAC_STATUSE) Register Mask  */


/** \brief PAC register offsets definitions */
#define PAC_WRCTRL_REG_OFST            (0x00)              /**< (PAC_WRCTRL) Write control Offset */
#define PAC_EVCTRL_REG_OFST            (0x04)              /**< (PAC_EVCTRL) Event control Offset */
#define PAC_INTENCLR_REG_OFST          (0x08)              /**< (PAC_INTENCLR) Interrupt enable clear Offset */
#define PAC_INTENSET_REG_OFST          (0x09)              /**< (PAC_INTENSET) Interrupt enable set Offset */
#define PAC_INTFLAGAHB_REG_OFST        (0x10)              /**< (PAC_INTFLAGAHB) Bridge interrupt flag status Offset */
#define PAC_INTFLAGA_REG_OFST          (0x14)              /**< (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A Offset */
#define PAC_INTFLAGB_REG_OFST          (0x18)              /**< (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B Offset */
#define PAC_INTFLAGC_REG_OFST          (0x1C)              /**< (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C Offset */
#define PAC_INTFLAGD_REG_OFST          (0x20)              /**< (PAC_INTFLAGD) Peripheral interrupt flag status - Bridge D Offset */
#define PAC_INTFLAGE_REG_OFST          (0x24)              /**< (PAC_INTFLAGE) Peripheral interrupt flag status - Bridge E Offset */
#define PAC_STATUSA_REG_OFST           (0x34)              /**< (PAC_STATUSA) Peripheral write protection status - Bridge A Offset */
#define PAC_STATUSB_REG_OFST           (0x38)              /**< (PAC_STATUSB) Peripheral write protection status - Bridge B Offset */
#define PAC_STATUSC_REG_OFST           (0x3C)              /**< (PAC_STATUSC) Peripheral write protection status - Bridge C Offset */
#define PAC_STATUSD_REG_OFST           (0x40)              /**< (PAC_STATUSD) Peripheral write protection status - Bridge D Offset */
#define PAC_STATUSE_REG_OFST           (0x44)              /**< (PAC_STATUSE) Peripheral write protection status - Bridge E Offset */

